#+COLUMNS: %25ITEM %NOTER_PAGE %NUM_COLUMNS
#+STARTUP: overview

*** Preface
    :PROPERTIES:
    :NOTER_PAGE: 15
    :END:
    #+begin_src elisp
      (let (ii jj
               (note-steps 17)
               (repeats 10))
        (measure-time
         (other-window 1)
         (dotimes (jj repeats)
           (dotimes (ii note-steps) (org-noter-sync-next-page-or-chapter))
           (dotimes (ii note-steps) (org-noter-sync-prev-page-or-chapter)))
         (other-window 1)))
    #+end_src

    #+RESULTS:
    : 4.525487

    org-babel is slow on subsequent runs after B9, but direct execution with C-x
    C-e does not suffer the same performance degradation.
    
*** Title page
    :PROPERTIES:
    :NOTER_PAGE: 1
    :END:

    #+begin_src elisp
      (let (ii jj
               (note-steps 138)
               (repeats 1))
        (measure-time
         (other-window 1)
         (dotimes (jj repeats)
           (dotimes (ii note-steps) (org-noter-sync-next-page-or-chapter))
           (dotimes (ii note-steps) (org-noter-sync-prev-page-or-chapter)))
         (other-window -1)))
    #+end_src

    #+RESULTS:
    : 10.116560

